//? Задача №1.
// Создайте массив words.
// Добавляйте в масив новые строки.
// Отсортируйте их по алфавиту.
// Строки в массиве не должны повторятся, так же не должны быть добавлены числа.

//* Решение
const words = [];

for (let i = 0; i > -1; i += 1) {
	let word = prompt('Введи слово! \nДля завершения нажми "Cancel".').toLowerCase();
	let number = Number(word);
	if (words.includes(word)) {
		continue;
	} else if (!isNaN(number)) {
		continue;
	} else if (word === null) {
		break;
	} else {
		words.push(word);
		words.sort();
	}
}
console.log(words);

//========================================================================================================================================================

//? Задача №2.
// Создайте массив users с элементами "Ваня" и "Иштван".
// Добавьте "Оля" в конец.
// Замените значение в "Иштван" на "Петя".
// Ваш код для поиска значения должен
// работать для массивов с любой длиной.
// Удалите первый элемент массива и покажите его.
// Вставьте "Маша" и "Паша" в начало массива.
//* Решение
// const arr = ['Ваня', 'Иштван'];
// arr.push('Оля');
// let index = arr.indexOf('Иштван');
// arr.splice(index, 1, 'Петя');
// console.log(arr.shift(1));
// arr.unshift('Маша', 'Паша');
// console.log(arr);

//========================================================================================================================================================

//? Задача №3.
// Удалить элемент 'Иштван' и возвратить его в переменную
// const names = ['Ваня', 'Иштван', 'Оля'];
//* Решение
// const nameIndex = names.indexOf('Иштван');
// const deletedName = names.splice(nameIndex, 1);
// console.log(deletedName);

//========================================================================================================================================================

//? Задача №4.
//Сделать из строки массив
let str = 'Ваня,Иштван,Оля';
//* Решение
// const arr = str.split(',');
// console.log(arr);

//========================================================================================================================================================
//========================================================================================================================================================
//========================================================================================================================================================
